tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "warrensbox/tap"

# terminal environment related packages
brew "diff-so-fancy"
brew "openssl"
brew "powerlevel10k"
brew "python"
brew "thefuck"
brew "tmux"
brew "yamllint"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "warrensbox/tap/tfswitch"
cask "iterm2-nightly"
cask "font-fira-code-nerd-font"

# cli utilities
brew "bat"
brew "git"
brew "fd"
brew "httpie"
brew "ipinfo-cli"
brew "jq"
brew "nmap"
brew "mas"
brew "ripgrep"
brew "testssl"
brew "tree"
brew "vim"
brew "watch"

# applications
cask "1password"
cask "scroll-reverser"
cask "firefox"
cask "google-cloud-sdk"
cask "rectangle"
cask "spotify"
cask "topnotch"
cask "visual-studio-code"
